/*
 * 1. for : 반복문 - 가장 많이 사용 
 *   향상된 for을 사용 : for-each구문 (web에서 주로 사용) 
 *   -배열 / 컬렉션 
 * 2. 형식 
 *   for(초기값;조건문;증감식){
 *     반복 수행문장 => 같은 형식의 출력이 있는 경우 
 *   }
 *            
 * 초기값 : 시작점 => int i=1 , int i=0 ... char c='A'
 *                    배열 / 컬렉션 => int i=0 
 * 조건문 : 끝점 =: i<=10 i>=1 .... 
 * 증감식 : i++ , i-- , += , -=
 *            
 * 
 * 동작
 *      ①--->②<------④ 
 * for(①초기값;②조건문;④증감식){
 *   ③ 반복 수행문장 
 * }
 * 
 */
public class 반복문_10 {

	public static void main(String[] args) {
		
	}
}